{
	"title": "Behavior Driven Development",
	"date": "12. Juni 2013",
	"url": "bdd",
	"location": {
		"name": "Freiraum",
		"url": "http://freiraumfreiburg.de/"
	},

	"abstract": {
		"title": "Behavior Driven Development im Web mit Behat/Mink",
		"intro": "Steffen Müller wird zum Thema Behavior Driven Development einen Vortrag halten und seine Erfahrung auf diesem Gebiet erläutern.",
		"text": "<p>Behavior Driven Development (BDD) in Softwareprojekten verfolgt zwei Ziele:<br> 1) Qualitätssicherung durch Dokumentation und Test der Software sowie<br> 2) Verständnis der Anforderungen an die Software sowohl auf Business- als auch Entwicklungsseite.<br> BDD ist eine agile Methode der Softwareentwicklung und lehnt sich an Prinzipien des Domain-Driven-Design an.</p> <p>Der Vortrag führt zum einen in das Thema BDD ein, um ein grundsätzlichen Verständnis dafür zu vermitteln. Zum anderen wird mit Praxisbeispielen die Nutzung von BDD veranschaulicht. Auf Basis des PHP-Framework \"Behat/Mink\" soll der Einsatz von BDD an Hand von typischen Anforderungen im Web demonstriert werden.</p> <p>Im Anschluss ist Zeit für eine Diskussion zum Thema und zum generellen Netzwerken.</p>",
		"short": "Behavior Driven Development (BDD) in Softwareprojekten verfolgt zwei Ziele: 1) Qualitätssicherung durch Dokumentation und Test der Software sowie 2) Verständnis der Anforderungen an die Software sowohl auf Business- als auch Entwicklungsseite. BDD ist eine agile Methode der Softwareentwicklung und lehnt sich an Prinzipien des Domain-Driven-Design an."
	},

	"speaker": {
		"name": "Steffen Müller",
		"website": "http://www.t3node.com/",
		"image": "img/steffen.jpg",
		"description": "<p>Steffen Müller ist Softwarearchitekt und -entwickler bei der /gebrüderheitz GmbH in Freiburg. Er arbeitet seit 15 Jahren im Web und ist aktiver Entwickler in Open Source Projekten. Zur Zeit leitet er als Active Contributor das Logging-Projekt für das Content Management System TYPO3. Seine Arbeit reflektiert er auf seinem <a href=\"http://www.t3node.com/\">persönlichen Blog</a> und auf <a href=\"http://twitter.com/t3node\">Twitter als @t3node</a>.</p>"
	}
}
